let students = [
    {
        name: '王大虎',
        grades: {
            语文: 90,
            数学: 80,
            英语: 60,
            物理: 99,
        },
    },
    {
        name: '王二虎',
        grades: {
            语文: 90,
            数学: 80,
            英语: 60,
        },
    },
    {
        name: '王小虎',
        grades: {
            语文: 90,
            数学: 80,
            英语: 60,
        },
    },
    {
        name: '张豆',
        grades: {
            语文: 90,
            数学: 80,
            英语: 60,
            物理: 100,
        },
    },
    {
        name: '张豆豆',
        grades: {
            语文: 90,
            数学: 80,
            英语: 60,
            生物: null,
        },
    },
    {
        name: '张小豆',
        grades: {
            语文: 90,
            数学: 80,
            英语: 60,
            物理: 100,
            化学: 100,
        },
    },
    {
        name: '张大豆',
        grades: {
            语文: 90,
            数学: 80,
            英语: 60,
            物理: 100,
            化学: null,
            生物: null,
        },
    },
    {
        name: '张二豆',
        grades: {
            语文: 90,
            数学: 80,
            英语: 60,
            物理: 100,
            化学: null,
            生物: null,
        },
    },
    {
        name: '肖美香',
        grades: {
            语文: 90,
            数学: 80,
            英语: 60,
            物理: 100,
            化学: null,
            生物: null,
        },
    },
    {
        name: '马冬梅',
        grades: {
            语文: 90,
            数学: 80,
            英语: 60,
            物理: 100,
            化学: null,
            生物: null,
        },
    },
    {
        name: '丁丁',
        grades: {
            语文: 90,
            数学: 80,
            英语: 60,
            物理: null,
            化学: null,
            生物: null,
        },
    },
    {
        name: '丁小丁',
        grades: {
            语文: 90,
            数学: 80,
            英语: 60,
            化学: null,
            生物: null,
        },
    },
    {
        name: '李明',
        grades: {
            语文: 90,
            数学: 80,
            英语: 60,
            物理: 100,
            生物: null,
        },
    },
    {
        name: '李小明',
        grades: {
            语文: 90,
            数学: 80,
            英语: 60,
            物理: null,
            化学: null,
            生物: null,
        },
    },
    {
        name: '赵跑跑',
        grades: {
            语文: 90,
            数学: 80,
            英语: 60,
            物理: 100,
            化学: null,
            生物: null,
        },
    },
    {
        name: '孙小孙',
        grades: {
            语文: 90,
            数学: 80,
            英语: 60,
            物理: 100,
            化学: null,
        },
    },
    {
        name: '黄希希',
        grades: {
            语文: null,
            数学: null,
            英语: null,
        },
    },
]



export default students;