let students = [
    {
        name: '王大虎',
        grades: {
            语文: 90,
            数学: 80,
            英语: 60,
            物理: 99,
        },
    },
    {
        name: '王二虎',
        grades: {
            语文: 90,
            数学: 80,
            英语: 60,
        },
    },
    {
        name: '王小虎',
        grades: {
            语文: 90,
            数学: 80,
            英语: 60,
        },
    },
    {
        name: '张豆',
        grades: {
            语文: 90,
            数学: 80,
            英语: 60,
            物理: 100,
        },
    },
    {
        name: '张豆豆',
        grades: {
            语文: 90,
            数学: 80,
            英语: 60,
            生物: null,
        },
    },
    {
        name: '张小豆',
        grades: {
            语文: 90,
            数学: 80,
            英语: 60,
            物理: 100,
            化学: 100,
        },
    },
    {
        name: '张大豆',
        grades: {
            语文: 90,
            数学: 80,
            英语: 60,
            物理: 100,
            化学: null,
            生物: null,
        },
    },
]



export default students;